#include "DSPWelder3ChCV9.h"
//флаги регистра флагов
#define PIDModeFl FlagReg.Bits.Flag0
#define ADCP0IntFl FlagReg.Bits.Flag1
#define ModeFl FlagReg.Bits.Flag2           //флаг режима 0 - MMA, 1 - MIG/MAG
#define DigitModifyFl FlagReg.Bits.Flag3
//#define ScrModifyFl FlagReg.Bits.Flag4       //
#define EEBusyFl FlagReg.Bits.Flag5         // 1 - занято, 0 - свободно
#define ADCP1IntFl FlagReg.Bits.Flag6
#define PIDCalcFl FlagReg.Bits.Flag7        // 0 - не считать, 1 - считать  
#define GasSupplyFl FlagReg.Bits.Flag8
#define ArcContrFl FlagReg.Bits.Flag9       // 0 - таймер сброшен, 1 - таймер установлен
#define T10msFl FlagReg.Bits.Flag10         // 0 - таймер 10мс считает 1 - таймер 10мс не считает
#define BlinkFl FlagReg.Bits.Flag11         //
#define T2Tic FlagReg.Bits.Flag12           //
#define T0n1msFl FlagReg.Bits.Flag13        //0 - таймер 0,1мс считает 1 - таймер 0,1мс не считает
#define IC1IntFl FlagReg.Bits.Flag14
//#define ShtCktFl FlagReg.Bits.Flag15
//флаги аварий во входном регистре
#define Thermo1Fl InpReg.Bits.Flag0
#define Thermo2Fl InpReg.Bits.Flag1
#define Thermo3Fl InpReg.Bits.Flag2
#define Thermo4Fl InpReg.Bits.Flag3
#define HVOKFl InpReg.Bits.Flag4
//режим работы в MIG
#define PARAM 0
#define SYNERGY 1
//коэффициенты пересчета по току и напряжению
#define kMMAMulI 256ul //256
#define kMulI 374ul 
#define kFragI 12
#define kDivI 64
#define kMulU 63ul
#define kDivU 1
#define kMulR 9ul 
#define kDivR 8192
//коэффициенты пересчета временных интервалов
#define kMulTime 427ul
#define kDivTime 128
#define kFragTime 17
#define kTime100 100u
#define kTime10 10u
//скорость остановленного мотора
#define StopMotorSpeed 0x0000
//максимальное напряжение
#define U_REG_MAX 4000 
//приращение тока в синергетическом режиме
#define U_SYN_DELTA 20
//максимальный ток
#define I_REG_MAX 3900
//частота преобразования
#define PWMFreq 33333ul

#define SW_MOD_SPEED 50
//временные константы
#define T2S 200
#define T3S 300
#define T0n1S 10
#define T0n42 14
#define T0n6 20
#define T0n81ms 27
#define T0n9ms 30
#define T2ms 67
#define T4n2ms 140
#define T20ms 677 
#define T25ms 834
#define T0n5S 5000
#define T10S 1000
//диапазоны чисел для параметров от подающего устройства
#define PARAM_MAX 7650
#define PARAM_MIN 20
#define PARAM1_BASE 7550
#define PARAM2_BASE 18780
//диапазон для параметров
#define PARAM_ADC_MAX 4000
//параметры в синергетическом режиме CO2
//проволока 0.8
const SYNERGY_PRM SynCO0n8Array[80]=
{ 
   //IGS  IGP Iб   U       V   
    {30, 40, 35, 100}, //2,0
    {30, 40, 35, 100}, //2,1
    {30, 40, 35, 100}, //2,2
    {30, 40, 35, 100}, //2,3
    {30, 40, 35, 100}, //2,4
    {30, 40, 35, 100}, //2,5
    {30, 40, 35, 100}, //2,6
    {30, 40, 35, 100}, //2,7
    {30, 40, 35, 100}, //2,8
    {30, 40, 35, 100}, //2,9
  //IGS  IGP Iб   U       V
    {30, 40, 35, 100}, //3,0
    {30, 40, 35, 100}, //3,1
    {30, 40, 40, 100}, //3,2
    {30, 40, 40, 100}, //3,3
    {30, 40, 40, 100}, //3,4    
    {30, 40, 40, 100}, //3,5
    {30, 40, 40, 100}, //3,6 
    {30, 40, 40, 100}, //3,7    
    {30, 40, 40, 100}, //3,8
    {30, 40, 40, 100}, //3,9
  //IGS  IGP Iб   U       V
    {30, 40, 40, 102}, //4,0
    {30, 40, 40, 102}, //4,1   
    {30, 40, 40, 103}, //4,2
    {30, 40, 40, 104}, //4,3    
    {30, 40, 40, 105}, //4,4
    {30, 40, 40, 106}, //4,5   
    {30, 40, 40, 107}, //4,6
    {30, 40, 40, 108}, //4,7    
    {30, 40, 40, 109}, //4,8
    {30, 40, 40, 110}, //4,9
  //IGS  IGP Iб   U       V
    {30, 40, 40, 112}, //5,0
    {30, 40, 40, 114}, //5,1  
    {30, 40, 40, 116}, //5,2
    {30, 40, 40, 118}, //5,3
    {30, 40, 40, 120}, //5,4
    {30, 40, 40, 122}, //5,5 
    {30, 40, 40, 124}, //5,6
    {30, 40, 40, 126}, //5,7
    {30, 40, 40, 128}, //5,8   
    {30, 40, 40, 130}, //5,9
  //IGS  IGP Iб   U       V
    {30, 40, 40, 132}, //6,0    
    {30, 40, 40, 133}, //6,1
    {30, 40, 40, 134}, //6,2   
    {30, 40, 40, 136}, //6,3
    {30, 40, 40, 138}, //6,4
    {30, 40, 40, 140}, //6,5
    {30, 40, 40, 142}, //6,6    
    {30, 40, 40, 144}, //6,7
    {30, 40, 40, 146}, //6,8
    {30, 40, 40, 148}, //6,9
  //IGS  IGP Iб   U       V
    {30, 40, 40, 150}, //7,0
    {30, 40, 40, 152}, //7,1
    {30, 40, 40, 154}, //7,2
    {30, 40, 40, 156}, //7,3
    {30, 40, 40, 158}, //7,4
    {30, 40, 40, 160}, //7,5
    {30, 40, 40, 162}, //7,6
    {29, 39, 40, 166}, //7,7  
    {29, 39, 40, 170}, //7,8
    {29, 39, 40, 172}, //7,9
  //IGS  IGP Iб   U       V
    {28, 38, 40, 176}, //8,0
    {28, 38, 40, 180}, //8,1
    {28, 38, 40, 184}, //8,2
    {28, 38, 40, 188}, //8,3
    {28, 38, 40, 192}, //8,4
    {27, 37, 40, 194}, //8,5
    {27, 37, 40, 196}, //8,6
    {27, 37, 40, 198}, //8,7
    {27, 37, 40, 200}, //8,8
    {27, 37, 40, 202}, //8,9
  //IGS  IGP Iб   U       V
    {26, 36, 40, 204}, //9,0
    {26, 36, 40, 208}, //9,1
    {26, 36, 40, 212}, //9,2
    {26, 36, 40, 216}, //9,3
    {26, 36, 40, 220}, //9,4
    {26, 36, 40, 224}, //9,5
    {26, 36, 40, 228}, //9,6
    {26, 36, 40, 230}, //9,7
    {26, 36, 40, 234}, //9,8
    {26, 36, 40, 236}, //9,9
};
//проволока 1.0
const SYNERGY_PRM SynCO1n0Array[80]=
{
  //IGS  IGP Iб   U       V 
    {20, 30, 40, 105}, //2,0    
    {20, 30, 40, 110}, //2,1
    {20, 30, 40, 111}, //2,2
    {20, 30, 40, 112}, //2,3
    {20, 30, 40, 113}, //2,4
    {20, 30, 40, 114}, //2,5
    {19, 29, 40, 116}, //2,6
    {18, 28, 40, 118}, //2,7
    {17, 27, 40, 120}, //2,8
    {16, 26, 40, 122}, //2,9
  //IGS  IGP Iб   U       V 
    {15, 25, 40, 124}, //3,0    
    {15, 25, 40, 128}, //3,1
    {15, 25, 40, 132}, //3,2    
    {15, 25, 40, 136}, //3,3
    {15, 25, 40, 140}, //3,4    
    {15, 25, 40, 144}, //3,5
    {14, 24, 40, 146}, //3,6    
    {14, 24, 40, 148}, //3,7
    {13, 23, 40, 150}, //3,8    
    {13, 23, 40, 152}, //3,9
  //IGS  IGP Iб   U       V
    {12, 22, 40, 154}, //4,0    
    {12, 22, 40, 156}, //4,1
    {12, 22, 40, 158}, //4,2    
    {12, 22, 40, 160}, //4,3
    {12, 22, 40, 162}, //4,4    
    {12, 22, 40, 164}, //4,5
    {12, 22, 40, 166}, //4,6    
    {12, 22, 40, 168}, //4,7
    {12, 22, 40, 170}, //4,8    
    {12, 22, 40, 173}, //4,9
  //IGS  IGP Iб   U       V
    {12, 22, 40, 176}, //5,0   
    {12, 22, 40, 178}, //5,1
    {12, 22, 40, 182}, //5,2    
    {12, 22, 40, 186}, //5,3
    {12, 22, 40, 190}, //5,4   
    {12, 22, 40, 194}, //5,5
    {12, 22, 40, 198}, //5,6    
    {12, 22, 40, 200}, //5,7
    {12, 22, 40, 202}, //5,8    
    {12, 22, 40, 204}, //5,9
  //IGS  IGP Iб   U       V
    {11, 21, 40, 206}, //6,0    
    {11, 21, 40, 208}, //6,1
    {11, 21, 40, 210}, //6,2    
    {11, 21, 40, 212}, //6,3
    {11, 21, 40, 214}, //6,4   
    {11, 21, 40, 216}, //6,5
    {11, 21, 40, 218}, //6,6    
    {11, 21, 40, 220}, //6,7
    {11, 21, 40, 224}, //6,8
    {11, 21, 40, 228}, //6,9
  //IGS  IGP Iб   U       V
    {11, 21, 40, 232}, //7,0    
    {11, 21, 40, 234}, //7,1
    {11, 21, 40, 236}, //7,2   
    {11, 21, 40, 238}, //7,3
    {11, 21, 40, 240}, //7,4    
    {11, 21, 40, 242}, //7,5
    {11, 21, 40, 244}, //7,6    
    {11, 21, 40, 246}, //7,7
    {11, 21, 40, 248}, //7,8
    {11, 21, 40, 250}, //7,9
  //IGS  IGP Iб   U       V   
    {11, 21, 40, 254}, //8,0  
    {11, 21, 40, 256}, //8,1
    {11, 21, 40, 258}, //8,2   
    {11, 21, 40, 260}, //8,3
    {11, 21, 40, 262}, //8,4    
    {11, 21, 40, 264}, //8,5
    {11, 21, 40, 266}, //8,6   
    {11, 21, 40, 268}, //8,7
    {11, 21, 40, 270}, //8,8
    {11, 21, 40, 272}, //8,9
  //IGS  IGP Iб   U       V    
    {11, 21, 40, 274}, //9,0    
    {11, 21, 40, 276}, //9,1
    {11, 21, 40, 278}, //9,2    
    {11, 21, 40, 282}, //9,3
    {11, 21, 40, 286}, //9,4   
    {11, 21, 40, 290}, //9,5
    {11, 21, 40, 294}, //9,6    
    {11, 21, 40, 298}, //9,7
    {11, 21, 40, 300}, //9,8    
    {11, 21, 40, 304}, //9,9
};
//проволока 1.2
const SYNERGY_PRM SynCO1n2Array[80]=
{
  //IGS  IGP Iб   U       V   
    {14, 24, 40, 154}, //2,0
    {14, 24, 40, 156}, //2,1
    {14, 24, 40, 160}, //2,2
    {14, 24, 40, 162}, //2,3
    {14, 24, 40, 164}, //2,4 
    {14, 24, 40, 166}, //2,5
    {14, 24, 40, 168}, //2,6
    {14, 24, 40, 170}, //2,7
    {14, 24, 40, 172}, //2,8
    {14, 24, 40, 174}, //2,9
  //IGS  IGP Iб   U       V  
    {14, 24, 40, 176}, //3,0    
    {14, 24, 40, 178}, //3,1
    {13, 23, 40, 180}, //3,2    
    {13, 23, 40, 182}, //3,3
    {12, 22, 40, 186}, //3,4   
    {12, 22, 40, 188}, //3,5
    {12, 22, 40, 192}, //3,6   
    {11, 21, 40, 194}, //3,7
    {11, 21, 40, 196}, //3,8   
    {11, 21, 40, 198}, //3,9
  //IGS  IGP Iб   U       V
    {10, 21, 40, 200}, //4,0  
    {10, 21, 40, 202}, //4,1
    {10, 21, 40, 204}, //4,2   
     {9, 21, 40, 206}, //4,3
     {9, 21, 40, 208}, //4,4    
     {9, 21, 40, 210}, //4,5
     {9, 21, 40, 212}, //4,6    
     {9, 21, 40, 214}, //4,7
     {9, 21, 40, 216}, //4,8    
     {9, 21, 40, 218}, //4,9
  //IGS  IGP Iб   U       V    
     {9, 21, 40, 222}, //5,0    
     {9, 21, 40, 224}, //5,1
     {9, 21, 40, 226}, //5,2    
     {9, 21, 40, 228}, //5,3
     {9, 21, 40, 230}, //5,4    
     {9, 21, 40, 232}, //5,5
     {9, 21, 40, 234}, //5,6   
     {9, 21, 40, 236}, //5,7
     {9, 21, 40, 238}, //5,8   
     {9, 21, 40, 240}, //5,9
  //IGS  IGP Iб   U       V
     {9, 21, 40, 241}, //6,0  
     {9, 21, 40, 242}, //6,1
     {9, 21, 40, 243}, //6,2    
     {9, 21, 40, 244}, //6,3
     {9, 21, 40, 246}, //6,4   
     {9, 21, 40, 247}, //6,5
     {9, 21, 40, 248}, //6,6    
     {9, 21, 40, 250}, //6,7
     {9, 21, 40, 252}, //6,8    
     {9, 21, 40, 254}, //6,9
  //IGS  IGP Iб   U       V
     {9, 21, 40, 256}, //7,0    
     {9, 21, 40, 258}, //7,1
     {9, 21, 40, 260}, //7,2   
     {9, 21, 40, 262}, //7,3
     {9, 21, 40, 264}, //7,4    
     {9, 21, 40, 266}, //7,5
     {9, 21, 40, 268}, //7,6    
     {9, 21, 40, 270}, //7,7
     {9, 21, 40, 272}, //7,8    
     {9, 21, 40, 274}, //7,9
  //IGS  IGP Iб   U       V
     {9, 21, 40, 276}, //8,0    
     {9, 21, 40, 278}, //8,1
     {9, 21, 40, 280}, //8,2    
     {9, 21, 40, 282}, //8,3
     {9, 21, 40, 284}, //8,4    
     {9, 21, 40, 286}, //8,5
     {9, 21, 40, 288}, //8,6    
     {9, 21, 40, 290}, //8,7
     {9, 21, 40, 292}, //8,8   
     {9, 21, 40, 294}, //8,9
  //IGS  IGP Iб   U       V
     {9, 21, 40, 296}, //9,0   
     {9, 21, 40, 298}, //9,1
     {9, 21, 40, 300}, //9,2    
     {9, 21, 40, 302}, //9,3
     {9, 21, 40, 306}, //9,4    
     {9, 21, 40, 310}, //9,5
     {9, 21, 40, 312}, //9,6    
     {9, 21, 40, 316}, //9,7
     {9, 21, 40, 320}, //9,8    
     {9, 21, 40, 322}, //9,9
};
//проволока 1.6
const SYNERGY_PRM SynCO1n6Array[80]=
{
  //IGS  IGP Iб   U       V   
     {5, 21, 40, 184}, //2,0
     {5, 21, 40, 186}, //2,1
     {5, 21, 40, 190}, //2,2
     {5, 21, 40, 194}, //2,3
     {5, 21, 40, 196}, //2,4 
     {5, 21, 40, 198}, //2,5
     {5, 21, 40, 200}, //2,6
     {5, 21, 40, 202}, //2,7
     {4, 21, 40, 203}, //2,8
     {4, 21, 40, 204}, //2,9
  //IGS  IGP Iб   U       V  
     {4, 21, 40, 206}, //3,0    
     {4, 21, 40, 208}, //3,1
     {4, 21, 40, 210}, //3,2    
     {4, 21, 40, 214}, //3,3
     {4, 21, 40, 218}, //3,4   
     {4, 21, 40, 222}, //3,5
     {4, 21, 40, 226}, //3,6   
     {4, 21, 40, 230}, //3,7
     {4, 21, 40, 234}, //3,8   
     {4, 21, 40, 238}, //3,9
  //IGS  IGP Iб   U       V
     {4, 21, 40, 244}, //4,0  
     {4, 21, 40, 248}, //4,1
     {4, 21, 40, 252}, //4,2   
     {3, 21, 40, 258}, //4,3
     {3, 21, 40, 262}, //4,4    
     {3, 21, 40, 266}, //4,5
     {3, 21, 40, 272}, //4,6    
     {3, 21, 40, 278}, //4,7
     {3, 21, 40, 284}, //4,8    
     {2, 21, 40, 288}, //4,9
  //IGS  IGP Iб   U       V    
     {2, 21, 40, 292}, //5,0    
     {2, 21, 40, 306}, //5,1
     {2, 21, 40, 310}, //5,2    
     {2, 21, 40, 314}, //5,3
     {2, 21, 40, 318}, //5,4    
     {2, 21, 40, 324}, //5,5
     {2, 21, 40, 332}, //5,6   
     {2, 21, 40, 336}, //5,7
     {2, 21, 40, 340}, //5,8   
     {2, 21, 40, 346}, //5,9
  //IGS  IGP Iб   U       V
     {2, 21, 40, 350}, //6,0  
     {2, 21, 40, 354}, //6,1
     {2, 21, 40, 358}, //6,2    
     {2, 21, 40, 362}, //6,3
     {2, 21, 40, 366}, //6,4   
     {2, 21, 40, 368}, //6,5
     {2, 21, 40, 372}, //6,6    
     {2, 21, 40, 376}, //6,7
     {2, 21, 40, 380}, //6,8    
     {2, 21, 40, 384}, //6,9
  //IGS  IGP Iб   U       V
     {2, 21, 40, 388}, //7,0    
     {2, 21, 40, 392}, //7,1
     {2, 21, 40, 393}, //7,2   
     {2, 21, 40, 394}, //7,3
     {2, 21, 40, 395}, //7,4    
     {2, 21, 40, 396}, //7,5
     {2, 21, 40, 397}, //7,6    
     {2, 21, 40, 398}, //7,7
     {2, 21, 40, 399}, //7,8    
     {2, 21, 40, 399}, //7,9
  //IGS  IGP Iб   U       V
     {2, 21, 40, 399}, //8,0    
     {2, 21, 40, 399}, //8,1
     {2, 21, 40, 399}, //8,2    
     {2, 21, 40, 399}, //8,3
     {2, 21, 40, 399}, //8,4    
     {2, 21, 40, 399}, //8,5
     {2, 21, 40, 399}, //8,6    
     {2, 21, 40, 399}, //8,7
     {2, 21, 40, 399}, //8,8   
     {2, 21, 40, 399}, //8,9
  //IGS  IGP Iб   U       V
     {2, 21, 40, 399}, //9,0   
     {2, 21, 40, 399}, //9,1
     {2, 21, 40, 399}, //9,2    
     {2, 21, 40, 399}, //9,3
     {2, 21, 40, 399}, //9,4    
     {2, 21, 40, 399}, //9,5
     {2, 21, 40, 399}, //9,6    
     {2, 21, 40, 399}, //9,7
     {2, 21, 40, 399}, //9,8    
     {2, 21, 40, 399}, //9,9
};
//параметры в синергетическом режиме Ar+CO2
//проволока 0.8
const SYNERGY_PRM SynAr0n8Array[80]=
{ 
   //IGS  IGP Iб   U       V   
    {35, 45, 35, 110}, //2,0
    {35, 45, 35, 110}, //2,1
    {35, 45, 35, 110}, //2,2
    {35, 45, 35, 110}, //2,3
    {35, 45, 35, 110}, //2,4
    {35, 45, 35, 110}, //2,5
    {35, 45, 35, 110}, //2,6
    {35, 45, 35, 110}, //2,7
    {35, 45, 35, 110}, //2,8
    {35, 45, 35, 110}, //2,9
  //IGS  IGP Iб   U       V
    {35, 45, 35, 110}, //3,0
    {35, 45, 35, 110}, //3,1
    {35, 45, 40, 110}, //3,2
    {35, 45, 40, 110}, //3,3
    {35, 45, 40, 110}, //3,4    
    {35, 45, 40, 110}, //3,5
    {35, 45, 40, 110}, //3,6 
    {35, 45, 40, 110}, //3,7    
    {35, 45, 40, 110}, //3,8
    {35, 45, 40, 110}, //3,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 110}, //4,0
    {35, 45, 40, 110}, //4,1   
    {35, 45, 40, 111}, //4,2
    {35, 45, 40, 112}, //4,3    
    {35, 45, 40, 113}, //4,4
    {35, 45, 40, 114}, //4,5   
    {35, 45, 40, 116}, //4,6
    {35, 45, 40, 118}, //4,7    
    {35, 45, 40, 120}, //4,8
    {35, 45, 40, 122}, //4,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 124}, //5,0
    {35, 45, 40, 125}, //5,1  
    {35, 45, 40, 126}, //5,2
    {35, 45, 40, 127}, //5,3
    {35, 45, 40, 128}, //5,4
    {35, 45, 40, 129}, //5,5 
    {35, 45, 40, 130}, //5,6
    {35, 45, 40, 132}, //5,7
    {35, 45, 40, 134}, //5,8   
    {35, 45, 40, 136}, //5,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 137}, //6,0    
    {35, 45, 40, 138}, //6,1
    {35, 45, 40, 139}, //6,2   
    {35, 45, 40, 140}, //6,3
    {35, 45, 40, 141}, //6,4
    {35, 45, 40, 142}, //6,5
    {35, 45, 40, 144}, //6,6    
    {35, 45, 40, 146}, //6,7
    {35, 45, 40, 148}, //6,8
    {35, 45, 40, 150}, //6,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 151}, //7,0
    {35, 45, 40, 152}, //7,1
    {35, 45, 40, 153}, //7,2
    {35, 45, 40, 154}, //7,3
    {35, 45, 40, 156}, //7,4
    {35, 45, 40, 158}, //7,5
    {35, 45, 40, 160}, //7,6
    {35, 45, 40, 162}, //7,7  
    {35, 45, 40, 164}, //7,8
    {35, 45, 40, 166}, //7,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 167}, //8,0
    {35, 45, 40, 168}, //8,1
    {35, 45, 40, 170}, //8,2
    {35, 45, 40, 172}, //8,3
    {35, 45, 40, 174}, //8,4
    {35, 45, 40, 176}, //8,5
    {35, 45, 40, 178}, //8,6
    {35, 45, 40, 180}, //8,7
    {35, 45, 40, 182}, //8,8
    {35, 45, 40, 184}, //8,9
  //IGS  IGP Iб   U       V
    {35, 45, 40, 185}, //9,0
    {35, 45, 40, 186}, //9,1
    {35, 45, 40, 187}, //9,2
    {34, 44, 40, 188}, //9,3
    {34, 44, 40, 189}, //9,4
    {34, 44, 40, 190}, //9,5
    {34, 44, 40, 192}, //9,6
    {33, 43, 40, 194}, //9,7
    {33, 43, 40, 196}, //9,8
    {33, 43, 40, 198}, //9,9
};
//проволока 1.0
const SYNERGY_PRM SynAr1n0Array[80]=
{
  //IGS  IGP Iб   U       V 
    {35, 45, 40, 105}, //2,0    
    {35, 45, 40, 106}, //2,1
    {35, 45, 40, 107}, //2,2
    {35, 45, 40, 108}, //2,3
    {35, 45, 40, 109}, //2,4
    {35, 45, 40, 110}, //2,5
    {34, 44, 40, 111}, //2,6
    {33, 43, 40, 112}, //2,7
    {32, 42, 40, 113}, //2,8
    {31, 41, 40, 114}, //2,9
  //IGS  IGP Iб   U       V 
    {30, 40, 40, 115}, //3,0    
    {30, 40, 40, 116}, //3,1
    {30, 40, 40, 117}, //3,2    
    {30, 40, 40, 118}, //3,3
    {30, 40, 40, 119}, //3,4    
    {30, 40, 40, 120}, //3,5
    {30, 40, 40, 121}, //3,6    
    {30, 40, 40, 122}, //3,7
    {30, 40, 40, 123}, //3,8    
    {30, 40, 40, 124}, //3,9
  //IGS  IGP Iб   U       V
    {30, 40, 40, 125}, //4,0    
    {29, 39, 40, 126}, //4,1
    {29, 39, 40, 127}, //4,2    
    {28, 38, 40, 128}, //4,3
    {28, 38, 40, 129}, //4,4    
    {27, 37, 40, 130}, //4,5
    {27, 37, 40, 131}, //4,6    
    {26, 36, 40, 132}, //4,7
    {26, 36, 40, 134}, //4,8    
    {25, 35, 40, 135}, //4,9
  //IGS  IGP Iб   U       V
    {25, 35, 40, 136}, //5,0   
    {25, 35, 40, 138}, //5,1
    {25, 35, 40, 140}, //5,2    
    {25, 35, 40, 142}, //5,3
    {25, 35, 40, 144}, //5,4   
    {25, 35, 40, 146}, //5,5
    {25, 35, 40, 148}, //5,6    
    {25, 35, 40, 149}, //5,7
    {25, 35, 40, 150}, //5,8    
    {25, 35, 40, 151}, //5,9
  //IGS  IGP Iб   U       V
    {25, 35, 40, 152}, //6,0    
    {25, 35, 40, 154}, //6,1
    {24, 34, 40, 156}, //6,2    
    {24, 34, 40, 158}, //6,3
    {24, 34, 40, 160}, //6,4   
    {23, 33, 40, 162}, //6,5
    {23, 33, 40, 164}, //6,6    
    {23, 33, 40, 166}, //6,7
    {22, 32, 40, 168}, //6,8
    {22, 32, 40, 170}, //6,9
  //IGS  IGP Iб   U       V
    {22, 32, 40, 172}, //7,0    
    {22, 32, 40, 174}, //7,1
    {22, 32, 40, 176}, //7,2   
    {22, 32, 40, 178}, //7,3
    {22, 32, 40, 180}, //7,4    
    {22, 32, 40, 182}, //7,5
    {22, 32, 40, 184}, //7,6    
    {22, 32, 40, 186}, //7,7
    {22, 32, 40, 188}, //7,8
    {22, 32, 40, 190}, //7,9
  //IGS  IGP Iб   U       V   
    {21, 31, 40, 192}, //8,0  
    {21, 31, 40, 194}, //8,1
    {21, 31, 40, 196}, //8,2   
    {21, 31, 40, 198}, //8,3
    {21, 31, 40, 200}, //8,4    
    {21, 31, 40, 202}, //8,5
    {21, 31, 40, 204}, //8,6   
    {21, 31, 40, 206}, //8,7
    {21, 31, 40, 208}, //8,8
    {21, 31, 40, 210}, //8,9
  //IGS  IGP Iб   U       V    
    {21, 31, 40, 212}, //9,0    
    {21, 31, 40, 214}, //9,1
    {21, 31, 40, 216}, //9,2    
    {21, 31, 40, 218}, //9,3
    {21, 31, 40, 220}, //9,4   
    {21, 31, 40, 222}, //9,5
    {21, 31, 40, 224}, //9,6    
    {21, 31, 40, 226}, //9,7
    {21, 31, 40, 230}, //9,8    
    {21, 31, 40, 234}, //9,9
};
//проволока 1.2
const SYNERGY_PRM SynAr1n2Array[80]=
{
  //IGS  IGP Iб   U       V   
    {31, 41, 40, 112}, //2,0
    {31, 41, 40, 114}, //2,1
    {30, 40, 40, 115}, //2,2
    {30, 40, 40, 116}, //2,3
    {29, 39, 40, 120}, //2,4 
    {29, 39, 40, 124}, //2,5
    {29, 39, 40, 128}, //2,6
    {29, 39, 40, 132}, //2,7
    {29, 39, 40, 136}, //2,8
    {29, 39, 40, 140}, //2,9
  //IGS  IGP Iб   U       V  
    {29, 39, 40, 141}, //3,0    
    {28, 38, 40, 142}, //3,1
    {27, 37, 40, 143}, //3,2    
    {26, 36, 40, 144}, //3,3
    {25, 35, 40, 146}, //3,4   
    {24, 34, 40, 148}, //3,5
    {24, 34, 40, 150}, //3,6   
    {24, 34, 40, 152}, //3,7
    {24, 34, 40, 154}, //3,8   
    {24, 34, 40, 156}, //3,9
  //IGS  IGP Iб   U       V
    {24, 34, 40, 157}, //4,0  
    {24, 34, 40, 158}, //4,1
    {24, 34, 40, 160}, //4,2   
    {24, 34, 40, 162}, //4,3
    {24, 34, 40, 164}, //4,4    
    {24, 34, 40, 166}, //4,5
    {24, 34, 40, 167}, //4,6    
    {24, 34, 40, 168}, //4,7
    {24, 34, 40, 170}, //4,8    
    {24, 34, 40, 172}, //4,9
  //IGS  IGP Iб   U       V    
    {24, 34, 40, 174}, //5,0    
    {24, 34, 40, 175}, //5,1
    {24, 34, 40, 176}, //5,2    
    {24, 34, 40, 177}, //5,3
    {24, 34, 40, 178}, //5,4    
    {24, 34, 40, 180}, //5,5
    {24, 34, 40, 182}, //5,6   
    {23, 33, 40, 184}, //5,7
    {23, 33, 40, 186}, //5,8   
    {23, 33, 40, 188}, //5,9
  //IGS  IGP Iб   U       V
    {22, 32, 40, 190}, //6,0  
    {22, 32, 40, 192}, //6,1
    {22, 32, 40, 194}, //6,2    
    {22, 32, 40, 196}, //6,3
    {22, 32, 40, 197}, //6,4   
    {22, 32, 40, 198}, //6,5
    {22, 32, 40, 200}, //6,6    
    {22, 32, 40, 202}, //6,7
    {22, 32, 40, 204}, //6,8    
    {22, 32, 40, 206}, //6,9
  //IGS  IGP Iб   U       V
    {22, 32, 40, 207}, //7,0    
    {22, 32, 40, 208}, //7,1
    {22, 32, 40, 210}, //7,2   
    {22, 32, 40, 212}, //7,3
    {22, 32, 40, 213}, //7,4    
    {22, 32, 40, 214}, //7,5
    {22, 32, 40, 216}, //7,6    
    {22, 32, 40, 218}, //7,7
    {22, 32, 40, 220}, //7,8    
    {22, 32, 40, 221}, //7,9
  //IGS  IGP Iб   U       V
    {22, 32, 40, 222}, //8,0    
    {22, 32, 40, 224}, //8,1
    {22, 32, 40, 226}, //8,2    
    {22, 32, 40, 228}, //8,3
    {22, 32, 40, 230}, //8,4    
    {22, 32, 40, 231}, //8,5
    {21, 31, 40, 232}, //8,6    
    {21, 31, 40, 234}, //8,7
    {21, 31, 40, 236}, //8,8   
    {21, 31, 40, 238}, //8,9
  //IGS  IGP Iб   U       V
    {20, 30, 40, 240}, //9,0   
    {20, 30, 40, 241}, //9,1
    {20, 30, 40, 242}, //9,2    
    {20, 30, 40, 244}, //9,3
    {20, 30, 40, 246}, //9,4    
    {20, 30, 40, 248}, //9,5
    {19, 29, 40, 250}, //9,6    
    {19, 29, 40, 252}, //9,7
    {19, 29, 40, 254}, //9,8    
    {19, 29, 40, 256}, //9,9
};
//проволока 1.6
const SYNERGY_PRM SynAr1n6Array[80]=
{
  //IGS  IGP Iб   U       V   
     {9, 21, 40, 170}, //2,0
     {9, 21, 40, 172}, //2,1
     {9, 21, 40, 174}, //2,2
     {9, 21, 40, 176}, //2,3
     {8, 21, 40, 178}, //2,4 
     {8, 21, 40, 180}, //2,5
     {8, 21, 40, 182}, //2,6
     {8, 21, 40, 184}, //2,7
     {7, 21, 40, 186}, //2,8
     {7, 21, 40, 188}, //2,9
  //IGS  IGP Iб   U       V  
     {7, 21, 40, 190}, //3,0    
     {7, 21, 40, 192}, //3,1
     {7, 21, 40, 194}, //3,2    
     {7, 21, 40, 196}, //3,3
     {7, 21, 40, 198}, //3,4   
     {7, 21, 40, 200}, //3,5
     {6, 21, 40, 202}, //3,6   
     {6, 21, 40, 204}, //3,7
     {6, 21, 40, 206}, //3,8   
     {6, 21, 40, 208}, //3,9
  //IGS  IGP Iб   U       V
     {6, 21, 40, 210}, //4,0  
     {6, 21, 40, 212}, //4,1
     {6, 21, 40, 214}, //4,2   
     {6, 21, 40, 216}, //4,3
     {6, 21, 40, 218}, //4,4    
     {5, 21, 40, 220}, //4,5
     {5, 21, 40, 222}, //4,6    
     {5, 21, 40, 224}, //4,7
     {5, 21, 40, 226}, //4,8    
     {5, 21, 40, 228}, //4,9
  //IGS  IGP Iб   U       V    
     {5, 21, 40, 230}, //5,0    
     {5, 21, 40, 232}, //5,1
     {5, 21, 40, 234}, //5,2    
     {5, 21, 40, 236}, //5,3
     {5, 21, 40, 238}, //5,4    
     {5, 21, 40, 240}, //5,5
     {5, 21, 40, 242}, //5,6   
     {5, 21, 40, 244}, //5,7
     {5, 21, 40, 246}, //5,8   
     {5, 21, 40, 250}, //5,9
  //IGS  IGP Iб   U       V
     {5, 21, 40, 254}, //6,0  
     {4, 21, 40, 258}, //6,1
     {4, 21, 40, 262}, //6,2    
     {4, 21, 40, 266}, //6,3
     {4, 21, 40, 270}, //6,4   
     {4, 21, 40, 274}, //6,5
     {4, 21, 40, 278}, //6,6    
     {4, 21, 40, 282}, //6,7
     {4, 21, 40, 286}, //6,8    
     {4, 21, 40, 290}, //6,9
  //IGS  IGP Iб   U       V
     {4, 21, 40, 294}, //7,0    
     {4, 21, 40, 298}, //7,1
     {4, 21, 40, 302}, //7,2   
     {4, 21, 40, 306}, //7,3
     {4, 21, 40, 310}, //7,4    
     {4, 21, 40, 314}, //7,5
     {4, 21, 40, 318}, //7,6    
     {4, 21, 40, 320}, //7,7
     {4, 21, 40, 322}, //7,8    
     {4, 21, 40, 324}, //7,9
  //IGS  IGP Iб   U       V
     {3, 21, 40, 326}, //8,0    
     {3, 21, 40, 328}, //8,1
     {3, 21, 40, 330}, //8,2    
     {3, 21, 40, 332}, //8,3
     {3, 21, 40, 334}, //8,4    
     {3, 21, 40, 336}, //8,5
     {3, 21, 40, 338}, //8,6    
     {3, 21, 40, 340}, //8,7
     {3, 21, 40, 342}, //8,8   
     {3, 21, 40, 344}, //8,9
  //IGS  IGP Iб   U       V
     {2, 21, 40, 346}, //9,0   
     {2, 21, 40, 348}, //9,1
     {2, 21, 40, 350}, //9,2    
     {2, 21, 40, 352}, //9,3
     {2, 21, 40, 354}, //9,4    
     {2, 21, 40, 356}, //9,5
     {2, 21, 40, 358}, //9,6    
     {2, 21, 40, 360}, //9,7
     {2, 21, 40, 364}, //9,8    
     {2, 21, 40, 368}, //9,9
};
//минимальные и максимальные значения параметров
//пределы для режима MMA
const LIMITS MMAILim={30,450};              //Экран 0, парметр 1, длина 3
//пределы  для режима MIG
const LIMITS MIGGasBeforeLim={0,50};        //Экран 1, парметр 5, длина 2
const LIMITS MIGGasAfterLim={0,50};         //Экран 1, парметр 6, длина 2
const LIMITS MIGLAddLim={0,20};
const LIMITS MIGULim={100,400};
const LIMITS MIGSpeedLim={20,99};
const LIMITS ProgrNumLim={1,22};
//параметры
INT16 MMAI;                 //1  - ток в режиме MMA
MIG_MOD MIGMod;             //2  - режим работы MIG
INT16 MIGGasBefore;         //3  - время подачи газа до сварки в режиме MIG
INT16 MIGGasAfter;          //4  - время подачи газа до сварки в режиме MIG
INT16 MIGLAdd;              //5  - добавочный коэффициент интегрирования в петле ОС по напряжению
INT16 MIGU;                 //7  - напряжение в режиме MIG/MAG
INT16 MIGSpeed;             //8  - скорость подачи в режиме MIG/MAG
INT16 ProgrNum;             //9  - номер программы
//переменные для усреднения
//тока
UINT32 IAvgSum;
UINT16 IAvg;
//напряжения
UINT32 UAvgSum;
UINT16 UAvg;
//переменные для обслуживания дисплея
UINT16 DM13Buf[5];
volatile BUT_REG ButReg, OldButReg;   //текущий и предыдущий регистры состояния кнопок
INT16 NewMIGU, OldMIGU;
INT16 NewMIGSpeed, OldMIGSpeed;
INT16 NewMMAI, OldMMAI;
//системные переменные
WORDBITS FlagReg;           //регистр флагов
UINT16 Timer10ms;           //таймер с дискретой 10 мс
UINT16 Timer0n1ms;          //таймер с дискретой 0.1 мс
ALM_REG AlmReg;             //регистр аварий
INT16 Index;
UINT16 ParamADC, OldParamADC;
UINT16 TMP;
//переменные для управления дугой
MMA_STATE MMAState;
MIG_STATE MIGState;         //переменная состояния общего алгоритма MIG
INT16 ArcTimer;             //таймер с дискретой опроса АЦП (30 мкс)
INT16 IfbCtrl, UfbCtrl;     //значения напряжения и тока, полученные от АЦП
INT16 OldIfbCtrl;
INT16  ISetCalc;            //отмасштабированные значения тока
INT16  USetSigned;
INT16 ISetSigned;
UINT16 USetM, ISetM;        //задание на регуляторы напряжения и тока
UINT16 ISetU;
UINT16 UOffset, NewUOffset;   
//переменные для режима MIG/MAG
UINT16 FeederSpeed;         //отмасштабированная скорость подачи MIG
UINT16 GasBeforeTime;       //задержка между открыванием клапана MIG и включением подачи в десятках мс
UINT16 GasAfterTime;
UINT16 UOut,UOutFire;       //начальное выходное напряжение источника в режиме MIG, при зажигании и расяетах
UINT16 BaseI;               //базовый ток дуги
UINT16 ISchMax;              //
UINT16 Param1, Param2;      //параметры, принимаемые по IC1
UINT32 Param1Sum, Param2Sum;//сумма для усреднения параметров, принимаемых по IC1
UINT16 MIGSpAVGCnt;         //счетчик для усреднения параметра скорости подачи в режиме MIG
UINT16 MIGUAVGCnt;          //счетчик для усреднения параметра напряжения в режиме MIG
UINT16 IMaxU;               //максимальное значение регулятора тока
UINT16 IMinU;               //минимальное значение регулятора тока
UINT16 IntGain;             //интегральный коэффициент усиления регулятора напряжения
UINT16 MIGFireTime;         //время зажигания
//внешние функции
extern void SetValve (void);
extern void ResValve (void);
extern void CalcUPIDRatio(UINT16 PropGain, UINT16 IntGain, UINT16 DerivGain);
//инициализация дисплея
extern void DispInit(void);
//управление мотором
extern void SetMIGMotorPWM(UINT16);
//функция чтения данных из EEPROM
extern void RD_EEPROM   (
                        UINT8* EEBufPtr,    //буфер в контроллере для чтения данных
                        UINT16 EEAddr,      //адрес в EEPROM, с которого будет производиться чтение
                        UINT16 Length       //количество байт, которое надо прочесть
                        );
//функция записи данных в EEPROM
extern void WR_EEPROM   (
                        UINT8* EEBufPtr,    //буфер в контроллере для записи данных
                        UINT16 EEAddr,      //адрес в EEPROM, с которого будет производиться запись
                        UINT16 Length       //количество байт, которое надо записать
                        );
//------------------------------------------------------------------------------------------------
//подпрограмма перевода из 2 в 10 в диапазоне от 0 до 999
//возвращает число в упакованном BCD формате
//если входное число вне диапазона, то возвращается -1
UINT16 Conv2to10(UINT16 InpData)
{
    UINT16 Num;
    UINT16 Result=0;
    UINT16 Carry;
    UINT8 ShiftCnt;
    if(InpData > 999)
        return -1;
    Num=InpData;
    Num=Num<<6;
    for(ShiftCnt = 0; ShiftCnt < 10; ShiftCnt++)
    {
        if(Num & 0x8000)
            Carry=1;
        else
            Carry=0;
        Num=Num<<1;
        Result=(Result<<1) | Carry;
        if(ShiftCnt!=9)
        {
            if(((Result & 0x000f)+0x000b) & 0x0010)
                Result+=0x0003;
            if(((Result & 0x00f0)+0x00b0) & 0x0100)
                Result+=0x0030;
        }
    }
    return Result;
}
//------------------------------------------------------------------------------------------------
// функция расчета параметров
void ParamsCalc (void)
{
    if(!ModeFl)
    {
        //расчет параметров для MMA
        ISetCalc=(MMAI*kMMAMulI)/kDivI;
    }
    else
    {
        Index=MIGSpeed-MIGSpeedLim.Min;
        if(Index < 0)
            Index=0;
        else if (Index > 79)
            Index=79;
        if(MIGMod.MIGModBits.WorkMd==0)
        {
            if(MIGMod.MIGModBits.GasMd==0)
            {
                if(MIGMod.MIGModBits.DiamMd == 0)
                {
                    BaseI=(SynCO0n8Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO0n8Array[Index].IntGainPrm-MIGLAdd;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                        UOutFire=((11*MIGSpeed+1184)*kMulU)/64;
                    else
                        UOutFire=((6*MIGSpeed+1331)*kMulU)/64;                
                }
                else if(MIGMod.MIGModBits.DiamMd == 1)
                {
                    BaseI=(SynCO1n0Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n0Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                        UOutFire=((102*MIGSpeed+10240)*kMulU)/512;
                    else
                        UOutFire=((51*MIGSpeed+11776)*kMulU)/512;
                    if(MIGSpeed <= 50)
                        MIGFireTime=T20ms;
                    else
                        MIGFireTime=T25ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 2)
                {
                    BaseI=(SynCO1n2Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n2Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
                else if(MIGMod.MIGModBits.DiamMd == 3)
                {
                    BaseI=(SynCO1n6Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n6Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
            }
            else
            {
                if(MIGMod.MIGModBits.DiamMd == 0)
                {
                    BaseI=(SynAr0n8Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr0n8Array[Index].IntGainPrm-MIGLAdd;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                        UOutFire=((11*MIGSpeed+1184)*kMulU)/64;
                    else
                        UOutFire=((6*MIGSpeed+1331)*kMulU)/64;                
                }
                else if(MIGMod.MIGModBits.DiamMd == 1)
                {
                    BaseI=(SynAr1n0Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n0Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                        UOutFire=((102*MIGSpeed+10240)*kMulU)/512;
                    else
                        UOutFire=((51*MIGSpeed+11776)*kMulU)/512;
                    if(MIGSpeed <= 50)
                        MIGFireTime=T20ms;
                    else
                        MIGFireTime=T25ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 2)
                {
                    BaseI=(SynAr1n2Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n2Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
                else if(MIGMod.MIGModBits.DiamMd == 3)
                {
                    BaseI=(SynAr1n6Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n6Array[Index].IntGainPrm-MIGLAdd;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }                
            }
        }
        else if(MIGMod.MIGModBits.WorkMd==1)
        {
            if(MIGMod.MIGModBits.GasMd==0)
            {
                if(MIGMod.MIGModBits.DiamMd == 0)
                {
                    BaseI=(SynCO0n8Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO0n8Array[Index].IntGainSyn;
                    MIGU=SynCO0n8Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 1)
                {
                    BaseI=(SynCO1n0Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n0Array[Index].IntGainSyn;
                    MIGU=SynCO1n0Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 2)
                {
                    BaseI=(SynCO1n2Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n2Array[Index].IntGainSyn;
                    MIGU=SynCO1n2Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
                else if(MIGMod.MIGModBits.DiamMd == 3)
                {
                    BaseI=(SynCO1n6Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynCO1n6Array[Index].IntGainSyn;
                    MIGU=SynCO1n6Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
            }
            else
            {
                if(MIGMod.MIGModBits.DiamMd == 0)
                {
                    BaseI=(SynAr0n8Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr0n8Array[Index].IntGainSyn;
                    MIGU=SynAr0n8Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 1)
                {
                    BaseI=(SynAr1n0Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n0Array[Index].IntGainSyn;
                    MIGU=SynAr1n0Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                }
                else if(MIGMod.MIGModBits.DiamMd == 2)
                {
                    BaseI=(SynAr1n2Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n2Array[Index].IntGainSyn;
                    MIGU=SynAr1n2Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }
                else if(MIGMod.MIGModBits.DiamMd == 3)
                {
                    BaseI=(SynAr1n6Array[Index].IBaseSyn*kMulI)/kDivI;
                    IntGain=SynAr1n6Array[Index].IntGainSyn;
                    MIGU=SynAr1n6Array[Index].UArcSyn+UOffset;
                    MIGFireTime=T20ms;
                    if(MIGSpeed <= 40)
                    {
                        UOutFire=((MIGSpeed+80)*kMulU)/4;
                        MIGFireTime=T20ms;
                    }
                    else
                    {
                        UOutFire=((59*MIGSpeed+13312)*kMulU)/512;
                        MIGFireTime=T25ms;
                    }
                }                
            }
        }
        IMinU=BaseI;
        IMaxU=(660*kMulI)/kDivI;
        UOut=(MIGU*kMulU*409ul)/4096;      
        GasBeforeTime=MIGGasBefore*kTime10;
        GasAfterTime=MIGGasAfter*kTime10;
    }
}
//------------------------------------------------------------------------------------------------
void ParamCalc(UINT16 Param)
{
    if((Param >= PARAM1_BASE) && (Param <=(PARAM1_BASE+PARAM_MAX+PARAM_MIN)))
    {
        Param1=Param-PARAM1_BASE;
        if(Param1 > PARAM_MAX)
            Param1=PARAM_MAX;
        if(Param1 < PARAM_MIN)
            Param1=PARAM_MIN;
        Param1Sum+=Param1;
        if(++MIGUAVGCnt == 128)
        {
            MIGUAVGCnt=0;
            Param1Sum/=128;
            if(MIGMod.MIGModBits.WorkMd != 2)
            {
                if(MIGMod.MIGModBits.WorkMd == 0)
                    NewMIGU=MIGULim.Min+((MIGULim.Max-MIGULim.Min)*Param1Sum)/(PARAM_MAX-PARAM_MIN);
                else if(MIGMod.MIGModBits.WorkMd==1)
                    NewUOffset=(U_SYN_DELTA*Param1Sum)/(PARAM_MAX-PARAM_MIN);
                if((NewMIGU >= (MIGU+2)) || (NewMIGU < (MIGU-2)))
                {
                    OldMIGU=MIGU;
                    MIGU=NewMIGU;
                    ParamsCalc();
                }
                if(NewUOffset != UOffset)
                {
                    UOffset=NewUOffset;
                    ParamsCalc();                
                }
            }
            Param1Sum=0;
        }
    }
    else if (Param >= PARAM2_BASE && Param <=(PARAM2_BASE+PARAM_MAX))
    {
        Param2=Param-PARAM2_BASE;
        if(Param2 > PARAM_MAX)
            Param2=PARAM_MAX;
        if(Param2 < PARAM_MIN)
            Param2=PARAM_MIN;
        Param2Sum+=Param2;
        if(++MIGSpAVGCnt == 128)
        {
            MIGSpAVGCnt=0;
            Param2Sum/=128;
            if(MIGMod.MIGModBits.WorkMd != 2)
            {
                NewMIGSpeed=MIGSpeedLim.Min+((MIGSpeedLim.Max-MIGSpeedLim.Min)*Param2Sum)/(PARAM_MAX-PARAM_MIN);
                if(MIGSpeed > MIGSpeedLim.Max)
                    NewMIGSpeed=MIGSpeedLim.Max;
                else if(MIGSpeed < MIGSpeedLim.Min)
                    NewMIGSpeed=MIGSpeedLim.Min;
                if((NewMIGSpeed >= (MIGSpeed+1)) || (NewMIGSpeed < (MIGSpeed-1)))
                {
                    OldMIGSpeed=MIGSpeed;
                    MIGSpeed=NewMIGSpeed;
                    FeederSpeed=MIGSpeed*12ul;
                    ParamsCalc();
                }
            }
            Param2Sum=0;
        }        
    }
}
//------------------------------------------------------------------------------------------------
UINT8 CheckParams(void)
{
    UINT8 Result=0;
    if(MMAI > MMAILim.Max)
    {
        MMAI=MMAILim.Max;
        Result=1;
    }
    if(MMAI < MMAILim.Min)
    {
        MMAI=MMAILim.Min;
        Result=1;
    }
    if(MIGMod.MIGModBits.WorkMd == 0x3)
    {
        MIGMod.MIGModBits.WorkMd=0;
        Result=1;
    }
    if(MIGMod.MIGModBits.ParSel > 0x4)
    {
        MIGMod.MIGModBits.ParSel=0;
        Result=1;
    }
    if(MIGGasBefore > MIGGasBeforeLim.Max)
    {
        MIGGasBefore = MIGGasBeforeLim.Max;
        Result=1;
    }
    if(MIGGasBefore < MIGGasBeforeLim.Min)
    {
        MIGGasBefore = MIGGasBeforeLim.Min;
        Result=1;
    }
    if(MIGGasAfter > MIGGasAfterLim.Max)
    {
        MIGGasAfter = MIGGasAfterLim.Max;
        Result=1;
    }
    if(MIGGasAfter < MIGGasAfterLim.Min)
    {
        MIGGasAfter = MIGGasAfterLim.Min;
        Result=1;
    }
    if(MIGLAdd > MIGLAddLim.Max)
    {
        MIGLAdd = MIGLAddLim.Max;
        Result=1;
    }
    if(MIGLAdd < MIGLAddLim.Min)
    {
        MIGLAdd = MIGLAddLim.Min;
        Result=1;
    }
    if(MIGU > MIGULim.Max)
    {
        MIGU = MIGULim.Max;
        Result=1;
    }
    if(MIGU < MIGULim.Min)
    {
        MIGU = MIGULim.Min;
        Result=1;
    }
    if(MIGSpeed > MIGSpeedLim.Max)
    {
        MIGSpeed = MIGSpeedLim.Max;
        Result=1;
    }
    if(ProgrNum > ProgrNumLim.Max)
    {
        ProgrNum = ProgrNumLim.Max;
        Result=1;
    }
    if(ProgrNum < ProgrNumLim.Min)
    {
        ProgrNum = ProgrNumLim.Min;
        Result=1;
    }
    return Result;
}
//------------------------------------------------------------------------------------------------
void InitProg(void)
{
    ButReg.ButReg=0;
    PIDCalcFl=0;
    GasSupplyFl=0;
    USetM=0;
    ISetM=0;
    MIGState=IDLE;
    MMAState=MMA_PROC;
    AlmReg.AlmReg=0;
    Timer10ms=100;//500
    T10msFl=0;
    UOffset=0;
    MIGU=300;
    OldMIGU=300;
    MIGSpeed=20;
    OldMIGSpeed=20;
    FeederSpeed=400;
    Param1Sum=0;
    Param2Sum=0;
    MIGSpAVGCnt=0;
    MIGUAVGCnt=0;
    OldIfbCtrl=0;
    IAvgSum=0;
    UAvgSum=0;
}
//------------------------------------------------------------------------------
void ParamInd(UINT16 Digits)
{
    switch((Digits & 0x00f0)>>4)
    {
        case 0:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_0;
            break;
        case 1:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_1;
            break;
        case 2:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_2;
            break;
        case 3:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_3;
            break;
        case 4:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_4;
            break;
        case 5:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_5;
            break;
        case 6:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_6;
            break;
        case 7:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_7;
            break;
        case 8:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_8;
            break;
        case 9:
            DM13Buf[1]=(DM13Buf[1] & A2_MASK) | A2_9;
            break;
    }
    switch(Digits & 0x000f)
    {
        case 0:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_0;
            break;
        case 1:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_1;
            break;
        case 2:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_2;
            break;
        case 3:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_3;
            break;
        case 4:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_4;
            break;
        case 5:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_5;
            break;
        case 6:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_6;
            break;
        case 7:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_7;
            break;
        case 8:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_8;
            break;
        case 9:
            DM13Buf[1]=(DM13Buf[1] & A3_MASK) | A3_9;
            break;
    }    
}
//------------------------------------------------------------------------------
void UInd (UINT16 Digits)
{
    switch((Digits & 0x0f00)>>8)
    {
        case 0:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_0;
            break;
        case 1:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_1;
            break;
        case 2:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_2;
            break;
        case 3:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_3;
            break;
        case 4:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_4;
            break;
        case 5:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_5;
            break;
        case 6:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_6;
            break;
        case 7:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_7;
            break;
        case 8:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_8;
            break;
        case 9:
            DM13Buf[4]=(DM13Buf[4] & A1U_MASK) | A1U_9;
            break;
    }       
    switch((Digits & 0x00f0)>>4)
    {
        case 0:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_0;
            break;
        case 1:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_1;
            break;
        case 2:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_2;
            break;
        case 3:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_3;
            break;
        case 4:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_4;
            break;
        case 5:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_5;
            break;
        case 6:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_6;
            break;
        case 7:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_7;
            break;
        case 8:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_8;
            break;
        case 9:
            DM13Buf[4]=(DM13Buf[4] & A2U_MASK) | A2U_9;
            break;
    }
    switch(Digits & 0x000f)
    {
        case 0:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_0;
            break;
        case 1:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_1;
            break;
        case 2:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_2;
            break;
        case 3:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_3;
            break;
        case 4:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_4;
            break;
        case 5:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_5;
            break;
        case 6:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_6;
            break;
        case 7:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_7;
            break;
        case 8:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_8;
            break;
        case 9:
            DM13Buf[3]=(DM13Buf[3] & A3U_MASK) | A3U_9;
            break;
    }    
}
//------------------------------------------------------------------------------
void IInd (UINT16 Digits)
{
    switch((Digits & 0x0f00)>>8)
    {
        case 0:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_0;
            break;
        case 1:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_1;
            break;
        case 2:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_2;
            break;
        case 3:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_3;
            break;
        case 4:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_4;
            break;
        case 5:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_5;
            break;
        case 6:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_6;
            break;
        case 7:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_7;
            break;
        case 8:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_8;
            break;
        case 9:
            DM13Buf[3]=(DM13Buf[3] & A1I_MASK) | A1I_9;
            break;
    }       
    switch((Digits & 0x00f0)>>4)
    {
        case 0:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_0;
            break;
        case 1:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_1;
            break;
        case 2:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_2;
            break;
        case 3:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_3;
            break;
        case 4:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_4;
            break;
        case 5:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_5;
            break;
        case 6:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_6;
            break;
        case 7:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_7;
            break;
        case 8:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_8;
            break;
        case 9:
            DM13Buf[2]=(DM13Buf[2] & A2I_MASK) | A2I_9;
            break;
    }
    switch(Digits & 0x000f)
    {
        case 0:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_0;
            break;
        case 1:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_1;
            break;
        case 2:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_2;
            break;
        case 3:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_3;
            break;
        case 4:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_4;
            break;
        case 5:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_5;
            break;
        case 6:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_6;
            break;
        case 7:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_7;
            break;
        case 8:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_8;
            break;
        case 9:
            DM13Buf[2]=(DM13Buf[2] & A3I_MASK) | A3I_9;
            break;
    }    
}
//------------------------------------------------------------------------------
void SetDiam(UINT16 Digits)
{
    MIGMod.MIGModBits.DiamMd=Digits;
    switch(Digits)
    {
        case 0:
            DM13Buf[1]=D0n8;
            break;
        case 1:
            DM13Buf[1]=D1n0;
            break;
        case 2:
            DM13Buf[1]=D1n2;
            break;
        case 3:
            DM13Buf[1]=D1n6;
            break;
    }
}
//------------------------------------------------------------------------------------------------
void ShowScreen(void)
{
    if(ModeFl)
    {
        if(MIGMod.MIGModBits.TorchButMd)
        {
            DM13Buf[0]|=LED4T;
            DM13Buf[0]&=~LED2T;                
        }
        else
        {
            DM13Buf[0]|=LED2T;
            DM13Buf[0]&=~LED4T;                 
        }
        if(MIGMod.MIGModBits.GasMd)
        {
            DM13Buf[0]|=LEDAR;
            DM13Buf[0]&=~LEDCO2;
        }
        else
        {
            DM13Buf[0]|=LEDCO2;
            DM13Buf[0]&=~LEDAR;               
        }
        if(MIGMod.MIGModBits.WorkMd==0)
        {
           DM13Buf[0]=(DM13Buf[0] & ~(LEDPAR | LEDSYN | LEDPGM)) | LEDPAR;                  
        }
        else if(MIGMod.MIGModBits.WorkMd==1)
        {
           DM13Buf[0]=(DM13Buf[0] & ~(LEDPAR | LEDSYN | LEDPGM)) | LEDSYN;
           SetDiam(MIGMod.MIGModBits.DiamMd); 
        }
        else if(MIGMod.MIGModBits.WorkMd==2)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDPAR | LEDSYN | LEDPGM )) | LEDPGM;
            ParamInd(Conv2to10(ProgrNum));
        }    
        if(MIGMod.MIGModBits.ParSel==0)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDL | LEDD | LEDGB | LEDGA | LEDNP)) | LEDL;
            ParamInd(Conv2to10(MIGLAdd));
        }
        else if(MIGMod.MIGModBits.ParSel==1)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDL | LEDD | LEDGB | LEDGA | LEDNP)) | LEDD;
            SetDiam(MIGMod.MIGModBits.DiamMd);
        }
        else if(MIGMod.MIGModBits.ParSel==2)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDL | LEDD | LEDGB | LEDGA | LEDNP)) | LEDGB;
            ParamInd(Conv2to10(MIGGasBefore));
            DM13Buf[1]|=A2_DP;            
        }
        else if(MIGMod.MIGModBits.ParSel==3)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDL | LEDD | LEDGB | LEDGA | LEDNP)) | LEDGA;
            ParamInd(Conv2to10(MIGGasAfter));
            DM13Buf[1]|=A2_DP;            
        }
        else if(MIGMod.MIGModBits.ParSel==4)
        {
            DM13Buf[0]=(DM13Buf[0] & ~(LEDL | LEDD | LEDGB | LEDGA | LEDNP)) | LEDNP;
            ParamInd(Conv2to10(ProgrNum));            
        }
        if(MIGState==IDLE)
        {
            UInd(Conv2to10(MIGU));
            IInd(Conv2to10(MIGSpeed));
            DM13Buf[2]|=A2I_DP;
        }
        else
        {
            UInd(Conv2to10((UAvg*kDivU*10)/kMulU));
            IInd(Conv2to10((UINT32)IAvg*kDivI*15/(kMulI*10)));
            DM13Buf[2]&=~A2I_DP;
        }
    }
    else
    {
        DM13Buf[4]=0;
        DM13Buf[3]&=0xff00;
        DM13Buf[1]=0;
        DM13Buf[0]=0;
        IInd(Conv2to10(MMAI));  
    }
    DigitModifyFl=1;
}
//------------------------------------------------------------------------------------------------
void InitDisplay(void)
{
    ButReg.ButReg=0xff;
    OldButReg.ButReg=0xff;
    RD_EEPROM((UINT8*)&MMAI, 0x0000u, 16u);
    while(EEBusyFl)
        __builtin_nop();
    if(CheckParams())
    {
        WR_EEPROM((UINT8*)&MMAI, 0x0000u, 16u);
        while(EEBusyFl)
            __builtin_nop();         
    }
    ParamsCalc();
    ShowScreen();
}
//------------------------------------------------------------------------------
void Display (void)
{
    if(!AlmReg.AlmBits.StartBit)
    {
        DM13Buf[0]=0;
        DM13Buf[1]=0;   
        DM13Buf[2]=0;   
        DM13Buf[3]=0;   
        DM13Buf[4]=0;
        return;
    }
    ShowScreen();
    if(ModeFl)
    {
        if((ButReg.ButReg == OldButReg.ButReg) && (ParamADC == OldParamADC) &&
           (MIGU == OldMIGU) && (MIGSpeed == OldMIGSpeed))
            return;
        if(ButReg.ButReg != OldButReg.ButReg)
        {
            if(!ButReg.ButBits.GasBtn && OldButReg.ButBits.GasBtn && (MIGMod.MIGModBits.WorkMd != 2))
            {
                if(MIGMod.MIGModBits.GasMd)
                    MIGMod.MIGModBits.GasMd=0;
                else
                    MIGMod.MIGModBits.GasMd=1;
                ParamsCalc();
            }
            if(!ButReg.ButBits.T24Btn && OldButReg.ButBits.T24Btn && (MIGMod.MIGModBits.WorkMd != 2))
            {
                if(MIGMod.MIGModBits.TorchButMd)
                    MIGMod.MIGModBits.TorchButMd=0;               
                else
                    MIGMod.MIGModBits.TorchButMd=1;               
            }
            if(!ButReg.ButBits.SPBtn && OldButReg.ButBits.SPBtn)
            {
                if(MIGMod.MIGModBits.WorkMd==0)
                {
                   MIGMod.MIGModBits.WorkMd=1;
                   MIGMod.MIGModBits.ParSel=1;                  
                }
                else if(MIGMod.MIGModBits.WorkMd==1)
                {
                   MIGMod.MIGModBits.WorkMd=2;
                   MIGMod.MIGModBits.ParSel=4;
                }
                else if(MIGMod.MIGModBits.WorkMd==2)
                {
                   MIGMod.MIGModBits.WorkMd=0;
                   MIGMod.MIGModBits.ParSel=1;
                }
                ParamsCalc();
            }
            if(!ButReg.ButBits.SelBtn && OldButReg.ButBits.SelBtn)
            {
                if(MIGMod.MIGModBits.WorkMd == 0)
                {
                    if(MIGMod.MIGModBits.ParSel==0)
                        MIGMod.MIGModBits.ParSel=1;
                    else if(MIGMod.MIGModBits.ParSel==1)
                        MIGMod.MIGModBits.ParSel=2;
                    else if(MIGMod.MIGModBits.ParSel==2)
                        MIGMod.MIGModBits.ParSel=3;
                    else if(MIGMod.MIGModBits.ParSel==3)
                        MIGMod.MIGModBits.ParSel=4;
                    else if(MIGMod.MIGModBits.ParSel==4)
                        MIGMod.MIGModBits.ParSel=0;
                    ParamsCalc();
                }
                else if (MIGMod.MIGModBits.WorkMd == 1)
                {
                    if(MIGMod.MIGModBits.ParSel==1)
                        MIGMod.MIGModBits.ParSel=2;
                    else if(MIGMod.MIGModBits.ParSel==2)
                        MIGMod.MIGModBits.ParSel=3;
                    else if(MIGMod.MIGModBits.ParSel==3)
                        MIGMod.MIGModBits.ParSel=1;
                    else
                        MIGMod.MIGModBits.ParSel=1;                        
                }
            }
            if(!ButReg.ButBits.MemBtn && OldButReg.ButBits.MemBtn && 
              (MIGMod.MIGModBits.WorkMd == 0 || MIGMod.MIGModBits.WorkMd == 2) && (MIGMod.MIGModBits.ParSel==4))
            {
                if(MIGMod.MIGModBits.WorkMd == 0)
                {
                    MIGMod.MIGModBits.WorkMd=2;
                    WR_EEPROM((UINT8*)&MMAI, ProgrNum*14u, 14u);
                    while(EEBusyFl)
                        __builtin_nop();
                    MIGMod.MIGModBits.WorkMd=0;  
                }
                if(MIGMod.MIGModBits.WorkMd == 2)
                {
                    RD_EEPROM((UINT8*)&MMAI, ProgrNum*14u, 14u);
                    while(EEBusyFl)
                        __builtin_nop();
                    if(CheckParams())
                    {
                        WR_EEPROM((UINT8*)&MMAI, ProgrNum*14u, 14u);
                        while(EEBusyFl)
                            __builtin_nop();                        
                    }
                    ParamsCalc();
                }
            }
            WR_EEPROM((UINT8*)&MMAI, 0x0000, 16u);
            while(EEBusyFl)
                __builtin_nop();             
        }
        if((ParamADC > OldParamADC + 2) || ParamADC < (OldParamADC - 2))
        {
            if((MIGMod.MIGModBits.ParSel==0) && (MIGMod.MIGModBits.WorkMd == 0))
            {
                MIGLAdd=MIGLAddLim.Min+((MIGLAddLim.Max - MIGLAddLim.Min)*
                        (unsigned long)ParamADC)/PARAM_ADC_MAX;
                ParamsCalc();
            }
            else if((MIGMod.MIGModBits.ParSel==1) && ((MIGMod.MIGModBits.WorkMd == 0) || (MIGMod.MIGModBits.WorkMd == 1)))
            {
                if(((4*ParamADC)/PARAM_ADC_MAX) > 3)
                    MIGMod.MIGModBits.DiamMd=3;
                else
                    MIGMod.MIGModBits.DiamMd=(4*ParamADC)/PARAM_ADC_MAX;
                ParamsCalc();
            }
            else if((MIGMod.MIGModBits.ParSel==2) && ((MIGMod.MIGModBits.WorkMd == 0) || (MIGMod.MIGModBits.WorkMd == 1)))
            {
                MIGGasBefore=MIGGasBeforeLim.Min+((MIGGasBeforeLim.Max - MIGGasBeforeLim.Min)*
                        (unsigned long)ParamADC)/PARAM_ADC_MAX;
            }
            else if((MIGMod.MIGModBits.ParSel==3) && ((MIGMod.MIGModBits.WorkMd == 0) || (MIGMod.MIGModBits.WorkMd == 1)))
            {
                MIGGasAfter=MIGGasAfterLim.Min+((MIGGasAfterLim.Max - MIGGasAfterLim.Min)*
                        (unsigned long)ParamADC)/PARAM_ADC_MAX;
            }
            else if((MIGMod.MIGModBits.ParSel==4) && ((MIGMod.MIGModBits.WorkMd == 0) || (MIGMod.MIGModBits.WorkMd == 2)))               
            {
                ProgrNum=ProgrNumLim.Min+((ProgrNumLim.Max - ProgrNumLim.Min)*
                        (unsigned long)ParamADC)/PARAM_ADC_MAX;
            }
        }
    }
    else
    {
        DM13Buf[4]=0;
        DM13Buf[3]&=0xff00;
        DM13Buf[1]=0;
        DM13Buf[0]=0;
        if(ParamADC != OldParamADC)
        {
            NewMMAI=MMAILim.Min+((MMAILim.Max - MMAILim.Min)*(unsigned long)ParamADC)/PARAM_ADC_MAX;
            if(NewMMAI > MMAILim.Max)
                NewMMAI=MMAILim.Max;
            else if (NewMMAI < MMAILim.Min)
                NewMMAI=MMAILim.Min;
            if((NewMMAI >= (MMAI+2)) || (NewMMAI < (MMAI-2)))
            {
                OldMMAI=MMAI;
                MMAI=NewMMAI;
                ParamsCalc();
            }            
            
        }
    }
}
//------------------------------------------------------------------------------
void ArcControl (void)
{
    INT32 TEMP;
    TEMP=(INT32)IAvgSum;
    TEMP=(TEMP-IAvgSum/32768)+IfbCtrl;
    IAvg=(UINT16)(TEMP/32768);
    IAvgSum=(UINT32)TEMP;
    TEMP=(INT32)UAvgSum;
    TEMP=(TEMP-UAvgSum/32768)+UfbCtrl;
    UAvg=(UINT16)(TEMP/32768);
    UAvgSum=(UINT32)TEMP;
    if(!AlmReg.AlmBits.StartBit)
    {
        PIDCalcFl=0;
        if(T10msFl)
                AlmReg.AlmBits.StartBit=1;
        return;
    }
    if(AlmReg.AlmBits.HVOK || AlmReg.AlmBits.Thermo1 || AlmReg.AlmBits.Thermo2 || AlmReg.AlmBits.Thermo3)
    {
        PIDCalcFl=0;
        return;
    }
    if(!ModeFl)
    {
        USetM=(60*kMulU)/kDivU;
        PIDModeFl=1;
        PIDCalcFl=1;
        switch(MMAState)
        {
            case MMA_PROC:
                ISetM=ISetCalc;
                if(UfbCtrl < ((4*kMulU)/kDivU))
                {
                    Timer10ms=T2S;
                    T10msFl=0;
                    MMAState=MMA_WAIT_OFF;
                    break;
                }
                break;
            case MMA_WAIT_OFF:
                if(!T10msFl)
                {
                    if (UfbCtrl > ((8*kMulU)/kDivU))
                    {
                        T10msFl=1;
                        MMAState=MMA_PROC;
                        break;
                    }
                }    
                else
                {
                    ISetM=0;
                    Timer10ms=T3S;
                    T10msFl=0;
                    MMAState=MMA_WAIT_ON;  
                    break;                        
                }
                break;
            case MMA_WAIT_ON:
                if(T10msFl)
                {
                    ISetM=ISetCalc;
                    Timer10ms=T0n1S;
                    T10msFl=0;                    
                    MMAState=MMA_ON;  
                    break;                        
                }
                break;
            case MMA_ON:
                if(!T10msFl)
                {
                    if(UfbCtrl > ((8*kMulU)/kDivU))
                    {
                        T10msFl=1;
                        MMAState=MMA_PROC;
                        break;  
                    }
                }
                else
                {
                    ISetM=0;
                    Timer10ms=T3S;
                    T10msFl=0;
                    MMAState=MMA_WAIT_ON;  
                    break;                        
                }
                break;
            default:
                MMAState=MMA_PROC;
                break;
        }
        return;
    }
    else
    {
        switch(MIGState)
        {
            case IDLE:
                if(!ButReg.ButBits.MIGBtn)
                {
                    SetValve();
                    Timer10ms=GasBeforeTime;
                    T10msFl=0;
                    PIDModeFl=0;
                    CalcUPIDRatio(1000, IntGain, 5); //0x0030, 0x0080
                    MIGState=WAIT_POWER_ON;
                    break;
                }
                else
                {
                    if(T10msFl)
                    {
                        USetM=0;
                        ISetM=0;
                        PIDCalcFl=0;
                        ResValve();
                    }
                    MIGState=IDLE;
                    break;
                }    
                break;
            case WAIT_POWER_ON:
                if((T10msFl && (MIGMod.MIGModBits.TorchButMd == 0)) || 
                  ((MIGMod.MIGModBits.TorchButMd == 1) && ButReg.ButBits.MIGBtn))
                {
                    USetM=UOutFire;
                    ISetM=ISetU;
                    PIDCalcFl=1;
                    SetMIGMotorPWM(FeederSpeed);
                    MIGState=WAIT_U;
                    break;
                }
                break;
            case WAIT_U:
                USetM=UOutFire;
                ISetM=ISetU;
                if(UfbCtrl > ((55*kMulU)/kDivU))//55
                {
                    MIGState=WAIT_FIRE;
                    break;
                }
                goto PROC_BUT;
                break;
            case WAIT_FIRE:
                USetM=UOutFire;
                ISetM=ISetU;
                if(UfbCtrl < ((50*kMulU)/kDivU))
                {
                    MIGState=FIRE;
                    ArcTimer=MIGFireTime;
                    ArcContrFl=0;                    
                    break;
                }
                goto PROC_BUT;
                break;
            case FIRE:
                USetM=UOutFire;
                ISetM=ISetU;
                if(ArcContrFl)
                {
                   MIGState=PROCESS_1;
                   CalcUPIDRatio(1000, IntGain, 5);
                   USetM=UOut;
                   ISetM=ISetU;
                   PIDModeFl=0;
                   Timer0n1ms=T0n5S;
                   T0n1msFl=0;
                   break;
                }
                goto PROC_BUT;
                break;
            case PROCESS_1:
                USetM=UOut;
                ISetM=ISetU;
                if(UfbCtrl < (16*kMulU)/kDivU)
                {
                    ArcTimer=T0n6;
                    ArcContrFl=0;
                    MIGState=PROCESS_2;
                    break;
                }
            PROC_BUT:
                SetMIGMotorPWM(FeederSpeed);
                if((MIGMod.MIGModBits.TorchButMd == 0) && ButReg.ButBits.MIGBtn) 
                {
                   USetM=UOut;
                   ISetM=ISetU;
                   SetMIGMotorPWM(StopMotorSpeed);
                   Timer10ms=T0n1S;
                   T10msFl=0;
                   MIGState=WAIT_INV;
                   break;
                }
                else if ((MIGMod.MIGModBits.TorchButMd == 1) && !ButReg.ButBits.MIGBtn)
                {
                   SetMIGMotorPWM(StopMotorSpeed);
                   MIGState=WAIT_0_4T;
                   USetM=U_REG_MAX;
                   break;
                }
                break;
            case PROCESS_2:
                USetM=UOut;
                ISetM=0;
                if(ArcContrFl)
                {
                   MIGState=PROCESS_3;
                   goto  PROC_BUT;                      
                }
                goto  PROC_BUT;
            case  PROCESS_3:
                USetM=UOut;
                ISetM=ISetU;
                if(UfbCtrl > UOut+(2*kMulU)/kDivU)
                {
                    MIGState=PROCESS_1;
                    ArcTimer=1;
                    ArcContrFl=0;
                    goto  PROC_BUT;                     
                }
                
                goto PROC_BUT;                  
            case WAIT_INV:
                USetM=UOut;
                ISetM=ISetU;
                if(T10msFl)
                {
                   USetM=0;
                   PIDCalcFl=0;
                   Timer10ms=GasAfterTime;
                   T10msFl=0;
                   MIGState=IDLE;
                   break;
                }
                break;
            case WAIT_0_4T:
                USetM=UOut;
                ISetM=ISetU;
                if(ButReg.ButBits.MIGBtn)
                {
                   USetM=0;
                   PIDCalcFl=0;
                   ResValve();
                   MIGState=IDLE;
                   break;
                }
                break;
            default:
                break;
        }
    }
}